Revit 2018 API
Plane Methods
The Plane type exposes the following members.
Methods
Name | Description
Create
 Creates a Plane object defined by a local frame of reference.
CreateByNormalAndOrigin
 Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
CreateByOriginAndBasis
 Creates a Plane object defined by the two orthogonal unit vectors and passing through the origin point supplied as arguments.
CreateByThreePoints
 Creates a Plane object passing through three points supplied as arguments.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Plane Class
Autodesk.Revit.DB Namespace